Revit 2027 API
BuiltInFailures.GeneralFailures.TransactionFailed Property
 [Description]
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId TransactionFailed { get; }
Public Shared ReadOnly Property TransactionFailed As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ TransactionFailed {
	FailureDefinitionId^ get ();
}
static member TransactionFailed : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GeneralFailures Class
Autodesk.Revit.DB Namespace